tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
brew "automake"
brew "bison"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "openssl@1.1"
brew "libssh2"
brew "criterion"
brew "docutils"
brew "doxygen"
brew "fd"
brew "readline"
brew "xz"
brew "gcalcli"
brew "gcc"
brew "gdbm"
brew "gobject-introspection"
brew "harfbuzz"
brew "libtiff"
brew "little-cms2"
brew "openjdk"
brew "h2", restart_service: true
brew "jq"
brew "libffi"
brew "libomp"
brew "libyaml"
brew "llvm@14"
brew "node"
brew "mongosh"
brew "mysql", restart_service: true
brew "neofetch"
brew "neovim"
brew "netcat"
brew "ninja"
brew "node@16"
brew "nvm"
brew "postgresql@14", restart_service: true
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "ruby-install"
brew "sphinx-doc"
brew "tree"
brew "jesseduffield/lazygit/lazygit"
brew "mongodb/brew/mongodb-community"
cask "skim"
vscode "1yib.svelte-bundle"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "clemenspeters.format-json"
vscode "crazyfluff.bettermaterialthemedarkerhighcontrast"
vscode "dbaeumer.vscode-eslint"
vscode "dendron.dendron-paste-image"
vscode "evzen-wybitul.magic-racket"
vscode "fivethree.vscode-svelte-snippets"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "kamen.noctis-high-contrast"
vscode "lextudio.restructuredtext"
vscode "mathiasfrohlich.kotlin"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "mushan.vscode-paste-image"
vscode "pandadigitalllc.panda-dark-ii"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "siegebell.prettify-symbols-mode"
vscode "slevesque.shader"
vscode "stevensona.shader-toy"
vscode "svelte.svelte-vscode"
vscode "tarik02.absolutely-black"
vscode "tinkertrain.theme-panda"
vscode "tomoki1207.pdf"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vincesalvino.dark-plus-black"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "wscats.vue"
